{
    "basics": {
        "name": "Sean Beach",
        "label": "Software Engineer",
        "summary": "Sean is a software engineer, specializing in Android app development, with a passion for video games and coffee. Sean started his education at Auburn University, where he learned the basics of programming. The following year, he transferred to the University of Memphis to complete his Computer Science degree. After graduation, he moved to Nashville to start his career as an Android developer. Over the years his skills have broadened to include iOS, .NET, and SQL. After moving to Nashville, Sean developed an interest in specialty coffee, and enjoys trying different coffees from around the world. When he gets the time and opportunity, he likes visiting Steadfast, Dose, and Crema. Sean likes to spend his free time watching movies with his wife, playing a variety of games, improving his skills, and reading about the technology industry at large.",
        "profiles": [
            {
                "network": "GitHub",
                "url": "https://github.com/sean0728"
            },
            {
                "network": "StackOverflow",
                "url": "http://stackoverflow.com/users/2608235"
            },
            {
                "network": "LinkedIn",
                "url": "https://www.linkedin.com/in/sbeachdev"
            }
        ]
    },
    "work": [
        {
            "company": "Onlife Health",
            "position": "Developer II",
            "website": "https://www.onlifehealth.com/",
            "startDate": "2017-04-24",
            "summary": "Lead mobile developer. Continued native Android tenure while branching into native iOS with Swift, .NET APIs, and SQL Server. Technical lead of white label effort to offer more branding options for clients, while simultaneously providing a streamlined experience for end users. The project expanded a single app immediately to four, with the capability to quickly scale up further through use of automated tools."
        },
        {
            "company": "TEKsystems",
            "position": "Developer II",
            "website": "https://www.teksystems.com/en/about-teksystems",
            "startDate": "2016-12-19",
            "endDate": "2017-04-24",
            "summary": "Contract-to-hire position with Onlife Health"
        },
        {
            "company": "Metova, Inc.",
            "position": "Developer",
            "website": "metova.com/about-us/",
            "startDate": "2015-08-07",
            "endDate": "2016-12-15",
            "summary": "Worked as part of distributed teams and to develop amazing software that delights customers. Primary focus on Android development, with minor experience in iOS. Short tenure on Angular project, using Cordova and the Ionic framework to develop apps for both Android and iOS from one code base."
        },
        {
            "company": "LifeWay Christian Resources",
            "position": "Software Engineer",
            "website": "http://www.lifeway.com/Article/About-Us",
            "startDate": "2014-02-04",
            "endDate": "2015-07-24",
            "summary": "Developed and maintained an Android application platform for reading and annotating ePub content. ePubs are streamed over the internet via an internal API, or downloaded and parsed locally. All content is encrypted at time of download, and decrypted on the fly as the user reads, including HTML5 video content. The platform also included a verbose library screen for all of the user's owned content, and an in-app store where they can purchase more. This project, via Gradle flavors and flexible coding, became the basis for 5 published applications on the Google Play store, the most prominent being WORDsearch Bible (https://play.google.com/store/apps/details?id=com.lifeway.wordsearchreader) with over 20,000 unique users and over 30,000 total installations."
        },
        {
            "company": "University of Memphis",
            "position": "Undergraduate Researcher",
            "website": "http://www.memphis.edu/cs/",
            "startDate": "2013-04-01",
            "endDate": "2013-12-01",
            "summary": "Android development as part of a faculty research project with Dr. Timothy Hnat. Attempted to modify the Android Open Source Project to include a new OS-level security protocol. The goal was to implement behavior learning of user action. Based upon past usage, the protocol would be able to recognize the device owner based upon hardware sensor readings, and determine if the current user is the owner. If the protocol detected otherwise, other security mechanisms would take effect, such as confirmation of device password, or answering a security question."
        }
    ],
    "volunteer": [
        {
            "organization": "Nashville Mobile Development User Group",
            "position": "Organizer",
            "website": "https://www.meetup.com/NashvilleMDUG/",
            "startDate": "2016-04-01",
            "endDate": "2020-01-01",
            "summary": "Helping organize monthly meetings for mobile technology professionals to network and increase their technical proficiencies. Past content has included Android study groups, iOS and Swift tutorials, and getting started with Unity. The group is a Google Development Group, and hosts an official Google I/O Extended event. Learn more about this group at Meetup.com. https://www.meetup.com/NashvilleMDUG/"
        }
    ],
    "education": [
        {
            "institution": "University of Memphis",
            "area": "Computer Science",
            "studyType": "Bachelor of Science (BS)",
            "startDate": "2011-08-01",
            "endDate": "2013-12-01",
            "gpa": "3.2",
            "courses": [
                "Computer organization and Architecture",
                "Networking and Information Assurance",
                "Programming Languages",
                "Operating Systems",
                "Capstone Software Project",
                "For the full list, visit http://www.memphis.edu/cs/courses/index.php"
            ]
        },
        {
            "institution": "Auburn University",
            "area": "Software Engineering",
            "startDate": "2010-08-01",
            "endDate": "2011-05-01"
        }
    ],
    "awards": [
        {
            "title": "Developing Android Apps",
            "date": "2015-06-30",
            "awarder": "Udacity",
            "summary": "Certification of completion for online course. https://www.udacity.com/course/ud853"
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        },
        {
            "language": "Java",
            "fluency": "Advanced"
        },
        {
            "language": "Javascript",
            "fluency": "Intermediate"
        },
        {
            "language": "Swift",
            "fluency": "Beginner"
        },
        {
            "language": ".NET",
            "fluency": "Beginner"
        }
    ],
    "interests": [
        {
            "name": "Magic: The Gathering",
            "keywords": [
                "Commander",
                "Booster Draft",
                "Legacy"
            ]
        },
        {
            "name": "Video Games",
            "keywords": [
                "Fire Emblem",
                "Ednless Legend",
                "Factorio"
            ]
        },
        {
            "name": "Coffee",
            "keywords": [
                "Steadfast",
                "Dose",
                "Crema"
            ]
        },
        {
            "name": "Tabletop Games",
            "keywords": [
                "Dungeons & Dragons",
                "Gizmos",
                "Stars Without Number"
            ]
        }
    ]
}
