{
    "basics": {
        "name": "Sean Beach",
        "label": "Software Engineer",
        "email": "sean@seandbeach.com",
        "phone": "(901) 896-5897",
        "summary": "Sean is a software engineer, specializing in Android app development, with a passion for video games and coffee. From a young age, Sean knew he wanted to work with computers and code. He took an interest in video games, and decided he wanted to create them. Years later, with this goal still in mind, he started his software career at Auburn University, where he learned the basics of programming. The following year, he transferred to the University of Memphis to continue his Computer Science education. He participated in the UM chapter of the Association for Computing Machinery (ACM). His fondest memories of his time with the ACM were his involvement in the funding proposal, acquisition of parts, assembly, and configuring of a Prusa Mendel (Iteration 2) 3D printer. After graduation, he moved to Nashville after accepting an offer to work as an Android developer for LifeWay Christian Resources. Sean likes to spend his free time seeing movies with his wife, playing video games, improving his skills, and reading about the technology industry at large. After moving to Nashville, he developed an interest in specialty coffee, and enjoys trying different coffees from around the world. He still hopes that he will one day be part of the development team of a triple-A video game release.",
        "location": {
            "city": "Nashville",
            "countryCode": "US",
            "region": "Tennessee"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "url": "https://www.linkedin.com/in/seandbeach"
            },
            {
                "network": "GitHub",
                "url": "https://github.com/sean0728"
            },
            {
                "network": "StackOverflow",
                "url": "http://stackoverflow.com/users/2608235"
            }
        ]
    },
    "work": [
        {
            "company": "Metova, Inc.",
            "position": "Developer",
            "website": "metova.com/about-us/",
            "startDate": "August 2015",
            "endDate": "",
            "summary": "Working directly with customers to produce amazing mobile apps. Primary focus on Android development, with minor personal experience in iOS. Also using Ionic with Angular and Cordova as a hybrid solution to develop apps for both Android and iOS from one code base."
        }
        {
            "company": "LifeWay Christian Resources",
            "position": "Software Engineer",
            "website": "http://www.lifeway.com/Article/About-Us",
            "startDate": "February 2014",
            "endDate": "July 2015",
            "summary": "Developed and maintained an Android application platform for reading and annotating ePub content. ePubs are streamed over the internet via an internal API, or downloaded and parsed locally. All content is encrypted at time of download, and decrypted on the fly as the user reads, including HTML5 video content. The platform also included a verbose library screen for all of the user's owned content, and an in-app store where they can purchase more. This project, via Gradle flavors and flexible coding, became the basis for 5 published applications on the Google Play store, the most prominent being WORDsearch Bible (https://play.google.com/store/apps/details?id=com.lifeway.wordsearchreader) with over 20,000 unique users and over 30,000 total installations."
        },
        {
            "company": "University of Memphis",
            "position": "Undergraduate Researcher",
            "website": "http://www.memphis.edu/cs/",
            "startDate": "April 2013",
            "endDate": "December 2013",
            "summary": "Android development within the scope of a faculty research project. Attempted to modify the Android Open Source Project to include a new OS-level security protocol. The goal was to implement behavior learning of user action. After one week of typical usage, the device would be able to recognize the user based upon hardware sensor readings, and determine if the current user is the owner of the device. If the protocol detected otherwise, other security mechanisms would take effect, such as confirmation of device password, or answering a security question."
        },
        {
            "company": "FedEx Services",
            "position": "Material Handler",
            "website": "http://about.van.fedex.com/",
            "startDate": "May 2011",
            "endDate": "April 2013",
            "summary": "Created spreadsheets and used proprietary software to manage inventory of returned products in a supply chain warehouse. Communicated directly to the customers to resolve any outstanding issues."
        }
    ],
    "skills": [
        {
            "name": "Android App Developer",
            "level": "Intermediate",
            "keywords": [
                "Android",
                "Java",
                "Javascript"
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "Hack Tennessee",
            "position": "Volunteer",
            "website": "http://www.hacktennessee.com/",
            "startDate": "June 2015",
            "endDate": "Present",
            "summary": "Working with a group of volunteers to create a classroom lesson for high school juniors and seniors to interest them in technology and show them what can be done through code. Read more about this project and watch the related video here: https://medium.com/hack-tennessee/hacking-with-purpose-30ac34313b87"
        }
    ],
    "education": [
        {
            "institution": "University of Memphis",
            "area": "Computer Science",
            "studyType": "Bachelor of Science (BS)",
            "startDate": "August 2011",
            "endDate": "December 2013",
            "gpa": "3.2",
            "courses": [
                "Computer organization and Architecture",
                "Networking and Information Assurance",
                "Programming Languages",
                "Operating Systems",
                "Capstone Software Project",
                "For the full list, visit http://www.memphis.edu/cs/courses/index.php"
            ]
        },
        {
            "institution": "Auburn University",
            "area": "Software Engineering",
            "startDate": "August 2010",
            "endDate": "May 2011"
        }
    ],
    "awards": [
        {
            "title": "Developing Android Apps",
            "date": "June 30, 2015",
            "awarder": "Udacity",
            "summary": "Certification of completion for online course. https://www.udacity.com/course/ud853"
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native speaker"
        },
        {
            "language": "Java",
            "fluency": "Advanced"
        },
        {
            "language": "Javascript",
            "fluency": "Intermediate"
        },
        {
            "language": "Scala",
            "fluency": "Beginner"
        },
        {
            "language": "Swift",
            "fluency": "Beginner"
        }
    ],
    "interests": [
        {
            "name": "Mobile Technology",
            "keywords": [
              "Android",
              "iOS",
              "Ionic",
              "Xamarin"
            ]
        },
        {
            "name": "Content Creation",
            "keywords": [
                "Twitch.tv",
                "Livestreaming",
                "Broadcasting",
                "YouTube.com"
            ]
        }
    ]
}
